#include "map.h"

string map0[100] = {
    "                          墙墙墙",
    "                        墙      墙",
    "                      墙        箱墙",
    "                    墙    教十堂    墙",
    "                  墙    房  芭  房    墙",
    "                  墙    房      房    墙",
    "                  墙    房      房    墙",
    "                  墙    房      房    墙",
    "                墙      房教  堂房      墙",
    "              墙                          墙",
    "              墙                          墙",
    "            墙              栏              墙",
    "            墙箱          栏风栏            墙",
    "            墙          栏  神  栏          墙",
    "            墙            栏像栏            墙",
    "            墙              栏    温        墙",
    "          墙                                  墙",
    "        墙                            房房      墙",
    "      墙    房骑士团房                屋屋        墙",
    "    墙    房  琴      房                            墙",
    "  墙      房          房                    房房房    墙",
    "墙        房莎        房                房房      天    墙",
    "墙          房大  门房                  木    卢  使    墙",
    "墙                                                的    墙",
    "墙    房房                              门        馈    墙",
    "墙    屋屋                              房房      赠    墙",
    "墙              冒台                        房房房      墙",
    "墙              险  台              房房                墙",
    "墙              家琳                屋屋      箱        墙",
    "  墙            协  台                      房房      墙",
    "    墙          会台                        屋屋    墙",
    "      墙箱                                        墙",
    "        墙墙墙墙墙墙墙墙城      门墙墙墙墙墙墙墙墙",
};
string map1[100] = {
    "                                    路    路",
    "                                    路    路",
    "                                  路    路",
    "                                  路    路",
    "                                    路    路",
    "                            岩山山石路      路石山山石石岩",
    "                    石岩岩山    丘                        山山石",
    "            岩石石岩山        树                    柴  箱      山",
    "          山山                木        水水水水        房房    山",
    "        岩        房房房房          水水水水水水水丘    屋屋      山",
    "        山    史  砖箱  砖        水水水水水水水水          史    岩",
    "路      山        砖砖  砖        水水水水水水水      房房          石",
    "  路路石                            水水水水水水      屋屋        岩岩",
    "                          七天    丘  水水水                    山",
    "路                        神像                                  路路",
    "  路路岩石        丘房房                                            路路",
    "        山山        屋屋                  房房    柴      树    路      ",
    "            石石          柴              屋屋            木岩岩  路路路",
    "                岩山岩                              石石山岩",
    "                      石    树          丘  箱石岩石",
    "                      石    木        山山山石",
    "                        岩    史    石",
    "                          路      路",
    "                          路      路",
    "                        路      路",
};
string map2[100] = {
    "        山山山山山山山山山山山山山山山山山",
    "      山山                    箱          山",
    "      山                      柱柱          山",
    "  山山                        柱柱  丘      山",
    "山        史                                  山",
    "山              风风风风风          柱  柱    山",
    "山            风          风      柱      柱  山",
    "山  柱柱    风    墙墙墙    风        核        山",
    "山  柱柱    风  墙      墙  风    柱      柱    山",
    "山          风  墙  龙  墙  风      柱  柱    山",
    "山          风  墙      墙  风              山",
    "山    丘    风    墙  墙    风              山",
    "山            风          风      柱柱      山",
    "山山            风风风风风        柱柱      山",
    "    山山                                  山",
    "      山    箱柱柱                遗迹  山",
    "        山    柱柱                守卫  山",
    "          山                          山",
    "            山山山            山山山山",
    "                  路        路",
};
string map3[100] = {
    "                                水水水水水水水路    路水",
    "                    水水水水水水水水水水水水水路    路水水水",
    "    水水水水水水水水水水水山山山山山山山山山路    路山山山水水",
    "  水水水水                  石石石        路      路箱山山水水水",
    "  水水水                      丘                            水水水水水水",
    "  山  水                山山山石山山山                          水水水水",
    "  山                  山山山山山山山山山山      忍      营地  水水水水山崖",
    "  山                山山      山山山山山山山      冬    史      山山山崖崖",
    "山赤洞                            山山山山      之                崖崖海海",
    "山    洞                    史      山山山山      树            崖海海海海海",
    "山洞丘                    山山山山山山山山山山                崖海海海海海海",
    "山  洞洞                  山山山山山  柱  山山                  崖海海海海海",
    "山                史    山山山山山          山山山            山山海海海海海海",
    "  山                  山山山山山      无相    柱山山山山山山山山        海海海",
    "  山                    山山    柱    之冰        山山山山山山    箱    海海海",
    "  山                    坚                                          海海海海海",
    "山                      冰              柱                  丘          海海海",
    "山  营地                山山山                                      海海海海海",
    "山箱                    山山                                          海海海海",
    "  山      遗迹        山山山        史                                  海海海海",
    "    山山  守卫    山山山山                              山山山      遗迹  海海海",
    "        山      山山山山山      营地                  山山山山山    守卫    崖海",
    "          山山山山山山山                山山      山海海海海山山          崖海海",
    "              山山山山山山山山山山山山山    山山山          海海海海海崖崖海海",
};
string map4[100] = {
    "山山山山山山山山山山山山山路      路山山山山山山山山山",
    "山山山山山山山山山山山山山山    山山山山山山山山山山山山",
    "山山山山山山山山      水水路    路水  山山山山山山山山山",
    "山山山              水水水      水水水              山山",
    "                    水水水    史水水水                  ",
    "          岛岛        水水丘      水水                  ",
    "          岛岛          水水      水水水                ",
    "                      水水土    土水水水        岛岛岛  ",
    "                    水水土        土水水      岛岛岛岛  ",
    "        木木木        水土    史  箱土水      岛岛岛    ",
    "      木箱    木      水水土      土水水        岛岛    ",
    "    木  望舒    木  水水水      土水水                  ",
    "    木  客栈      桥水      丘  水水水                  ",
    "    木  魈                  水水水水          岛岛      ",
    "      木    木桥桥        水水水              岛岛岛    ",
    "        木木  水水      水水水水                岛      ",
    "                水水      水水                          ",
    "                  水桥  犬桥水                          ",
    "                水水桥    桥水水",
};
string map5[100] = {
    "                      水水桥        桥水水",
    "    山山山水水水水水水水水水桥    桥水水水水水水",
    "  山山山水水水水水水水水水水桥    桥水水水水水水水",
    "山山山水水水水水水水水水水桥        桥海海海海海海海海海海海海海",
    "山山山水水墙路路路路路路路  士        墙墙墙木木木木木木木木木木海",
    "山山山水墙路                                                  木海",
    "山山山山墙路    路        房  房墙          木木木木木  木木木木海",
    "山山    墙路    路      房      房墙      木海海海海船  船海海海",
    "山    墙路    路        屋    钟屋墙        木海  船    箱船    ",
    "      墙路    路          屋  屋  墙        木海    船船船      ",
    "      楼        台        廊                木海                ",
    "    楼月楼        台      廊      墙        木海                ",
    "    楼海楼    甘  台      廊  廊  墙      木海海海海海海海海海海",
    "山  楼亭楼        台      廊  廊墙          木木木木木木木木木木海",
    "山山  楼        台        廊  廊                            箱木海",
    "山山山水路  路水台      房      房        木木木木木木木木木木木海",
    "山山山水路  路水台            箱屋        木海海海海海海海海海海",
    "山山  路      路        屋屋屋屋屋        木海                  ",
    "山楼楼          台  胡                摊  木海                  ",
    "山楼玉楼          台                  贩  砖海                  ",
    "山楼京楼  凝      台栏栏桥      桥砖砖砖砖海                    ",
    "山楼台楼          台水水水桥  桥海                              ",
    "山楼楼          台崖水水水桥  桥海            海海海海海海      ",
    "山  崖台台台台台崖水水水桥      桥海        海台台台台台台海    ",
    "路水崖崖崖崖崖水水石石石          木海    海台            台海  ",
    "  路水水水水砖砖砖  七天            木海  海台  摊贩      台海  ",
    "    路桥桥桥        神像            木海海台台        摊  台海  ",
    "路                                    栏栏            贩  台海  ",
    "海路路桥桥桥                                              台海  ",
    "海海海海海海栏栏    墙    墙墙                            台海  ",
    "            海海栏房          房                          台海  ",
    "              海栏房    香    房  砖栏栏栏台    货货  箱  台海  ",
    "              海栏  房万民堂房  砖海海海海海台  货货      台海  ",
    "                海崖崖崖崖崖崖崖海        海台台台台台台台海    ",
    "                  海海海海海海海            海海海海海海海",
};
string map6[100] = {
    "                  山山山山山山山山",
    "        山山山山山山    丘        山山                          ",
    "    山    山山山山                    山山山      山            ",
    "      山山山山山                            山山    山          ",
    "  山山山山山山                          山      山  山          ",
    "  山山山山山                              山箱    山山山        ",
    "山山山山山山        犬                    山山    山山山        ",
    "山箱山山山                渊渊            山山      山山山      ",
    "山    山山山            渊    渊                犬    山山      ",
    "山        山          渊        渊                    山山      ",
    "山                    渊        渊                      山      ",
    "山                      渊    渊                  山      路    ",
    "  山        山            渊渊                丘  山山      路路",
    "  山          山                                  山山山        ",
    "    山        山                                  箱山山山路    ",
    "    山      犬  山山                  山            山山山  路路",
    "      山山山                    山山山山          山山山        ",
    "        山山山山        山山山山山山山      史  山山山          ",
    "            山山山山山山山山山山          山山山山山山          ",
    "                  山山山山山山山山山山山山山山",
};
const string map_name[7] = {
    "蒙德城", "清泉镇", "风龙废墟", "龙脊雪山", "荻花洲", "璃月港", "层岩巨渊"
};
World::World(){
    map_num = 7;
    maps = new Map[7]{Map(0), Map(1), Map(2), Map(3), Map(4), Map(5), Map(6)};
}

World::~World(){

}
void World::show_map(){
    string s[10] = {
        "  风龙废墟    蒙德城",
        "          \\    /",
        "          清泉镇一龙脊雪山",
        "            /",
        "          荻花洲",
        "            |",
        "层岩巨渊一璃月港",
    };
    for(int i = 0; i < 7; i++){
        cout << s[i] << endl;
    }
}

Map* World::get_map(){
    return maps;
}
void Map::remove_a_character(int x, int y){
    int real_y = 0;
    for(int i = 0; i < y; i++){
        if(picture[x][real_y] == ' '){
            real_y += 2;
        }
        else{
            real_y += 3;
        }
    }
    picture[x].replace(real_y, 3, "  ");
}
Map::Map(int i){
    found = false;
	index = i;
    name = map_name[i];
    switch(i){
        case 0:
        for(int i = 0; i < 100; i++){
		    picture[i] = map0[i];
	    }
        break;
        case 1:
        for(int i = 0; i < 100; i++){
		    picture[i] = map1[i];
	    }
        break;
        case 2:
        for(int i = 0; i < 100; i++){
		    picture[i] = map2[i];
	    }
        break;
        case 3:
        for(int i = 0; i < 100; i++){
		    picture[i] = map3[i];
	    }
        break;
        case 4:
        for(int i = 0; i < 100; i++){
		    picture[i] = map4[i];
	    }
        break;
        case 5:
        for(int i = 0; i < 100; i++){
		    picture[i] = map5[i];
	    }
        break;
        default:
        for(int i = 0; i < 100; i++){
		    picture[i] = map6[i];
	    }
    }
}
Map::~Map(){

}

string* Map::get_picture(){
    return picture;
}
string Map::get_map_name(){
    return name;
}
bool Map::get_found(){
    return found;
}